src_ext/Catalogs/УЗ_ДисконтныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_ДисконтныеКарты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКартыШтрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_ДвижениеДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_ДвижениеДисконтныхКарт</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Catalogs/УЗ_ДисконтныеКарты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КодКартыШтрихкодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Текст = СокрЛП(Текст);
	Объект.КодКартыШтрихкод = Текст;
	Объект.Наименование = ""+Объект.Владелец + " [" +Текст+ "]";
	Элементы.ДекорацияКоличество.Заголовок = "" +СтрДлина(Текст)+ " зн.";
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если СтрДлина(Объект.КодКартыШтрихкод) > 0 Тогда 
		Элементы.ДекорацияКоличество.Заголовок = "" +СтрДлина(Объект.КодКартыШтрихкод)+ " зн.";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОстатокБонусов = ПолучитьОстатокБонусов();
	КонецЕсли;
	
	ОбновитьСтатусКарты(ЭтотОбъект, ТекущаяДатаСеанса());

	ЭлементОтбора = Документы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДисконтнаяКарта");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбора = Документы.Отбор.Элементы[0];
	ЭлементОтбора.Использование = Истина;
	Элементы.Документы.Обновить();

КонецПроцедуры

Функция ПолучитьОстатокБонусов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеДисконтныхКартОстатки.СуммаБонусовОстаток КАК СуммаБонусовОстаток
	|ИЗ
	|	РегистрНакопления.УЗ_ДвижениеДисконтныхКарт.Остатки КАК ДвижениеДисконтныхКартОстатки
	|ГДЕ
	|	ДвижениеДисконтныхКартОстатки.ДисконтнаяКарта = &ДисконтнаяКарта";	
	Запрос.УстановитьПараметр("ДисконтнаяКарта", Объект.Ссылка); 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СуммаБонусовОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

//Статус на сегодня — то же правило, что при начислении и списании бонусов (Документы.УЗ_ПриходДенег.
//ПроверитьСрокДисконтнойКарты): с даты начала по день окончания включительно, без «Не действует».
//Дата — сеанса (часовой пояс информационной базы), а не компьютера.
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСтатусКарты(Форма, Сейчас)

	Карта = Форма.Объект;
	Действует = НЕ Карта.НеДействует
		И (НЕ ЗначениеЗаполнено(Карта.ДатаНачалаДействия) Или НачалоДня(Карта.ДатаНачалаДействия) <= Сейчас)
		И (НЕ ЗначениеЗаполнено(Карта.ДатаОкончанияДействия) Или Сейчас <= КонецДня(Карта.ДатаОкончанияДействия));
	Форма.Элементы.ДекорацияНЕДЕЙСТВИТЕЛЬНА.Видимость = НЕ Действует;
	Форма.Элементы.ДекорацияДействует.Видимость = Действует;

КонецПроцедуры

//на клиенте даты сеанса нет — берём с сервера (правка срока — редкое действие)
&НаСервереБезКонтекста
Функция ДатаСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ДатаОкончанияДействияПриИзменении(Элемент)
	ОбновитьСтатусКарты(ЭтотОбъект, ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаДействияПриИзменении(Элемент)
	ОбновитьСтатусКарты(ЭтотОбъект, ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура ДействуетПриИзменении(Элемент)
	ОбновитьСтатусКарты(ЭтотОбъект, ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//наименование из владельца и штрихкода; штрихкод не трогаем (прежде бралась незаданная переменная
	//«Текст», и пустое наименование стирало штрихкод карты)
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Штрихкод = СокрЛП(Объект.КодКартыШтрихкод);
		Объект.Наименование = ""+Объект.Владелец + ?(ЗначениеЗаполнено(Штрихкод)," [" +Штрихкод+ "]","");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаДействия) Тогда 
		Объект.ДатаНачалаДействия = УЗ_Сервер.ДатаСеанса();	//срок карты — по времени сервера (Codex Т2)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокБонусовНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = ОткрытьДвиженяПоДисконтнойКартеНаСервере(Объект.Ссылка);
	ОткрытьФорму("Отчет.УЗ_ОтчетПоДисконтнымКартам.Форма", ПараметрыОткрытия, ЭтаФорма); 
КонецПроцедуры

&НаСервере
Функция ОткрытьДвиженяПоДисконтнойКартеНаСервере(Значение)
	
	КомпоновщикНастроек = Отчеты.УЗ_ОтчетПоДисконтнымКартам.Создать().КомпоновщикНастроек; 
	Настройки 			= КомпоновщикНастроек.Настройки; 
	
	ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")); 
	//ЭлементНастройки.Значение.ДатаНачала    = '00010101';//НачалоГода(ТекущаяДата());
	//ЭлементНастройки.Значение.ДатаОкончания = '00010101';//КонецГода(ТекущаяДата());
	Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда 
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки); 
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда 
			//ПользовательскийПараметр.Значение = ЭлементНастройки.Значение;
			ПользовательскийПараметр.Использование = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	ОтборДисконтнаяКарта = Новый ПолеКомпоновкиДанных("ДисконтнаяКарта");
	//ОтборПериод = Новый ПолеКомпоновкиДанных("Период");
	
	Для Каждого ЭлементНастройки Из Настройки.Отбор.Элементы Цикл 
		Если ЭлементНастройки.ЛевоеЗначение = ОтборДисконтнаяКарта Тогда 
			ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементНастройки.ПравоеЗначение = Значение; 
			ЭлементНастройки.Использование = Истина; 
			Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда 
				ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки); 
				Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
					ПользовательскийПараметр.ВидСравнения = ЭлементНастройки.ВидСравнения; 
					ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение; 
					ПользовательскийПараметр.Использование = ЭлементНастройки.Использование; 
				КонецЕсли; 
			КонецЕсли;
			Прервать; 
		КонецЕсли; 
	КонецЦикла; 
	
	ПараметрыОткрытия = Новый Структура(); 
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина); 
	ПараметрыОткрытия.Вставить("Вариант", Настройки); 
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки); 
	
	Возврат ПараметрыОткрытия;
	
КонецФункции
